# Final project-N.N.2

Q.N.1-כתוב תוכנית בשפת פייתון אשר מקבלת מספר בבסיס 10 ומדפיסה את המספר בכל הבסיסים
האחרים )בסיס 2 ,בסיס 8 ובסיס 16

In [3]:
def plus(a,b):
  return a + b

In [4]:
def hello():
  print("Hello World") 
  return

In [8]:
def differentBase (num,base):
    ans=0;
    while (num!=0):
        ans==num%2;
        DifB = ans, DifB;
        num=math.floor(ans/2 )
    print (DifB)

In [9]:
print (5/2)

2.5

In [9]:
differentBase(6,2)

UnboundLocalError: local variable 'DifB' referenced before assignment

In [10]:

num=number;
while (reminder>=0):
    binaryAns==num%2;
        DifB = DifB,binaryAns ;
        num=math.floor(ans/2 );
print ("The Binary value of ", number, "is: ",DifB)

IndentationError: unexpected indent (<ipython-input-10-9eb2f2ef0141>, line 4)

Q.N.2

In [1]:
import pandas as pd
df=pd.read_csv (r"C:\Users\yuval\cast.csv")
df

,title,year,name,type,character,n
0,Suuri illusioni,1985,Homo $,actor,Guests,22.0
1,Gangsta Rap: The Glockumentary,2007,Too $hort,actor,Himself,NaN
2,Menace II Society,1993,Too $hort,actor,Lew-Loc,27.0
3,Porndogs: The Adventures of Sadie,2009,Too $hort,actor,Bosco,3.0
4,Stop Pepper Palmer,2014,Too $hort,actor,Himself,NaN
...,...,...,...,...,...,...
3333690,Stuttur Frakki,1993,Sveinbj?rg ??rhallsd?ttir,actress,Flugfreyja,24.0
3333691,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0
3333692,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0
3333693,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0
3333694,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN

section 1

In [77]:
All_group =df.groupby(['title', 'year'])
temp=All_group.title.value_counts()['Hamlet']
print("There are",temp.shape[0],"movies with the title 'Hamlet'.")

There are 17 movies with the title 'Hamlet'.

section 2

In [86]:
All_group=df.groupby(['title', 'year'])
temp=All_group.title.value_counts()['Treasure Island']
temp

#temp.sort_values(by=['year'])
#newDF=All_group.get_group('Treasure Island')
#print(newDF.sort_values(by=['year']))


#by_year=df.groupby('title')
#newDF=by_year.get_group('Treasure Island')
#print(newDF.sort_values(by=['year']))

#df['title']#['Treasure Island']
#df.sort_values(by=['year'])

year  title
1918  Treasure Island    13
1920  Treasure Island    12
1934  Treasure Island    55
1950  Treasure Island    34
1972  Treasure Island    25
1973  Treasure Island     9
1985  Treasure Island    15
1999  Treasure Island    24
Name: title, dtype: int64

section 3

In [45]:
dftemp=df.query('title == "Hamlet" and year == "1921" ')
dftemp
print ("there are", dftemp.shape[0], "roles were credited in the silent 1921 version of 'Hamlet'.")

there are 9 roles were credited in the silent 1921 version of 'Hamlet'.

section 4

In [102]:
dfHamlet= df.groupby(['title']).get_group("Hamlet")################4delete duplicates

ByDecades=dfHamlet.groupby(['year'])
#ByDecades.plot()
ByDecades

In [138]:
dfHamlet=df.query('title == "Hamlet"')
ans=dfHamlet.drop_duplicates(subset=['year']).sort_values(by=['year'])
#withDec=ans.insert(2, "Decade", [1910, 1920, 1930, 1940, 1950, 1960, 1970, 1980, 1990, 2000, 2010], True) 
#ans.plot.bar()
#ans.plot.barh(stacked=True)
#ans.plot(x ='Decade', y='Movies number', kind = 'bar')
##########ans.plot(x ='year', y='Movies number', kind = 'bar')
ans.groupby([ans.year//10*10]).count()
#ans
#plt.show()
#withDec

      title  year  name  type  character  n
year
1910      3     3     3     3          3  2
1920      1     1     1     1          1  1
1940      1     1     1     1          1  1
1950      1     1     1     1          1  1
1960      2     2     2     2          2  1
1970      2     2     2     2          2  1
1980      1     1     1     1          1  0
1990      2     2     2     2          2  2
2000      2     2     2     2          2  2
2010      2     2     2     2          2  1

section 5

In [96]:
dfActor1950=df.query('year == 1950 and n == 1 and type=="actor"')
dfActor1951=df.query('year == 1951 and n == 1 and type=="actor"')
dfActor1952=df.query('year == 1952 and n == 1 and type=="actor"')
dfActor1953=df.query('year == 1953 and n == 1 and type=="actor"')
dfActor1954=df.query('year == 1954 and n == 1 and type=="actor"')
dfActor1955=df.query('year == 1955 and n == 1 and type=="actor"')
dfActor1956=df.query('year == 1956 and n == 1 and type=="actor"')
dfActor1957=df.query('year == 1957 and n == 1 and type=="actor"')
dfActor1958=df.query('year == 1958 and n == 1 and type=="actor"')
dfActor1959=df.query('year == 1959 and n == 1 and type=="actor"')

dfActress1950=df.query('year == 1950 and n == 1 and type=="actress"')
dfActress1951=df.query('year == 1951 and n == 1 and type=="actress"')
dfActress1952=df.query('year == 1952 and n == 1 and type=="actress"')
dfActress1953=df.query('year == 1953 and n == 1 and type=="actress"')
dfActress1954=df.query('year == 1954 and n == 1 and type=="actress"')
dfActress1955=df.query('year == 1955 and n == 1 and type=="actress"')
dfActress1956=df.query('year == 1956 and n == 1 and type=="actress"')
dfActress1957=df.query('year == 1957 and n == 1 and type=="actress"')
dfActress1958=df.query('year == 1958 and n == 1 and type=="actress"')
dfActress1959=df.query('year == 1959 and n == 1 and type=="actress"')

print ("In the year 1950, there are", dfActor1950.shape[0],"leading (n=1) roles were available to actors,and",dfActress1950.shape[0],"leading (n=1) roles were available to actresses.")
print ("In the year 1951, there are", dfActor1951.shape[0],"leading (n=1) roles were available to actors,and",dfActress1951.shape[0],"leading (n=1) roles were available to actresses.")
print ("In the year 1952, there are", dfActor1952.shape[0],"leading (n=1) roles were available to actors,and",dfActress1952.shape[0],"leading (n=1) roles were available to actresses.")
print ("In the year 1953, there are", dfActor1953.shape[0],"leading (n=1) roles were available to actors,and",dfActress1953.shape[0],"leading (n=1) roles were available to actresses.")
print ("In the year 1954, there are", dfActor1954.shape[0],"leading (n=1) roles were available to actors,and",dfActress1954.shape[0],"leading (n=1) roles were available to actresses.")
print ("In the year 1955, there are", dfActor1955.shape[0],"leading (n=1) roles were available to actors,and",dfActress1955.shape[0],"leading (n=1) roles were available to actresses.")
print ("In the year 1956, there are", dfActor1956.shape[0],"leading (n=1) roles were available to actors,and",dfActress1956.shape[0],"leading (n=1) roles were available to actresses.")
print ("In the year 1957, there are", dfActor1957.shape[0],"leading (n=1) roles were available to actors,and",dfActress1957.shape[0],"leading (n=1) roles were available to actresses.")
print ("In the year 1958, there are", dfActor1958.shape[0],"leading (n=1) roles were available to actors,and",dfActress1958.shape[0],"leading (n=1) roles were available to actresses.")
print ("In the year 1959, there are", dfActor1959.shape[0],"leading (n=1) roles were available to actors,and",dfActress1959.shape[0],"leading (n=1) roles were available to actresses.")

In the year 1950, there are 604 leading (n=1) roles were available to actors,and 271 leading (n=1) roles were available to actresses.
In the year 1951, there are 633 leading (n=1) roles were available to actors,and 272 leading (n=1) roles were available to actresses.
In the year 1952, there are 591 leading (n=1) roles were available to actors,and 284 leading (n=1) roles were available to actresses.
In the year 1953, there are 634 leading (n=1) roles were available to actors,and 290 leading (n=1) roles were available to actresses.
In the year 1954, there are 626 leading (n=1) roles were available to actors,and 298 leading (n=1) roles were available to actresses.
In the year 1955, there are 606 leading (n=1) roles were available to actors,and 264 leading (n=1) roles were available to actresses.
In the year 1956, there are 614 leading (n=1) roles were available to actors,and 288 leading (n=1) roles were available to actresses.
In the year 1957, there are 708 leading (n=1) roles were available to actors,and 284 leading (n=1) roles were available to actresses.
In the year 1958, there are 694 leading (n=1) roles were available to actors,and 275 leading (n=1) roles were available to actresses.
In the year 1959, there are 678 leading (n=1) roles were available to actors,and 287 leading (n=1) roles were available to actresses.

section 6

In [79]:
dftemp=df.query('n == 1 and year >= 1990 ')
new=dftemp.groupby('name').size()#get row counts per each group of name,by calling .size(), which returns a Series
FinalAns=new.sort_values(ascending=False) #Sort values by descending order
print("10 actors/actresses that have the most leading roles (n=1) since the 1990's are:")
FinalAns.head(10)

10 actors/actresses that have the most leading roles (n=1) since the 1990's are:

name
Mohanlal              126
Mammootty             118
Akshay Kumar           87
Jayaram                76
Andy Lau               72
Ajay Devgn             69
Eric Roberts           68
Amitabh Bachchan       68
Nagarjuna Akkineni     60
Dilip                  59
dtype: int64

section 7

In [95]:
dftemp=df.query('name=="Frank Oz" ')
groupAns=dftemp.groupby(['title', 'year']).size()
FinalAns=groupAns.sort_values(ascending=False) #Sort values by descending order
FinalAns.sort_index(level=1)#sort specify index level(in this case- by year)

title                                           year
The Muppet Movie                                1979    8
Star Wars: Episode V - The Empire Strikes Back  1980    1
The Blues Brothers                              1980    1
An American Werewolf in London                  1981    2
The Great Muppet Caper                          1981    6
The Dark Crystal                                1982    2
Star Wars: Episode VI - Return of the Jedi      1983    1
Superman III                                    1983    1
Trading Places                                  1983    1
The Muppets Take Manhattan                      1984    7
Sesame Street Presents: Follow that Bird        1985    3
Spies Like Us                                   1985    1
Labyrinth                                       1986    1
Innocent Blood                                  1992    1
The Muppet Christmas Carol                      1992    7
Muppet Treasure Island                          1996    4
Blues Brothers 2000                             1998    1
Muppets from Space                              1999    4
Star Wars: Episode I - The Phantom Menace       1999    1
The Adventures of Elmo in Grouchland            1999    3
Monsters, Inc.                                  2001    1
Star Wars: Episode II - Attack of the Clones    2002    1
Star Wars: Episode III - Revenge of the Sith    2005    1
Zathura: A Space Adventure                      2005    1
Inside Out                                      2015    1
dtype: int64

In [ ]:
dftemp=df.query('n > 1 and name=="Frank Oz" ')
#sortByYear=
dftemp.sort_values(by=['year'])
#by=sortByYear.groupby('title')